{
  "intents": [
    {
      "tag": "saludo",
      "patterns": ["Hola", "Buen día", "Buenas tardes", "Saludos"],
      "responses": [
        "¡Hola! ¿En qué puedo ayudarte hoy?",
        "Saludos, bienvenido a la Universidad Nacional de Colombia, sede Medellín. ¿Cómo puedo asistirte?"
      ]
    },
    {
      "tag": "informacion_general",
      "patterns": [
        "Cuéntame sobre la Universidad Nacional sede Medellín",
        "Necesito información sobre la Universidad Nacional de Colombia sede Medellín"
      ],
      "responses": [
        "La Universidad Nacional de Colombia, Sede Medellín, es conocida por su excelencia académica y su compromiso con la investigación. ¿Quieres saber algo específico?"
      ]
    },
    {
      "tag": "admisiones",
      "patterns": [
        "¿Cómo puedo aplicar para pregrado?",
        "¿Qué necesito para inscribirme en un programa de postgrado?",
        "¿Dónde encuentro información sobre admisiones?",
        "Quiero inscribirme en un programa, ¿cómo procedo?"
      ],
      "responses": [
        "Puedes encontrar toda la información sobre el proceso de admisión en nuestra página web: https://admisiones.unal.edu.co/"
      ]
    },
    {
      "tag": "programas_academicos",
      "patterns": [
        "¿Dónde puedo encontrar los programas de pregrado disponibles?",
        "¿Dónde puedo ver los programas de postgrado que ofrece la universidad?",
        "¿Cuáles son las especializaciones que ofrece la universidad?"
      ],
      "responses": [
        "Puedes consultar todos nuestros programas de pregrado y postgrado en nuestro catálogo online en https://posgrados.unal.edu.co/catalogo/"
      ]
    },
    {
      "tag": "programas_disponibles",
      "patterns": [
        "¿Qué programas académicos ofrece la universidad?",
        "¿Qué carreras puedo estudiar en la Universidad Nacional?"
      ],
      "responses": [
        "Ofrecemos una amplia gama de programas académicos en diversas facultades. ¿Te interesa alguna facultad en particular?"
      ]
    },
    {
      "tag": "cursos_capacitaciones",
      "patterns": [
        "¿Dónde puedo encontrar cursos de educación continua?",
        "¿Ofrecen cursos de idiomas?",
        "¿Qué cursos pagos están disponibles?"
      ],
      "responses": [
        "Toda la información sobre nuestros cursos de educación continua y de idiomas la encuentras aquí: https://centrodeidiomas.medellin.unal.edu.co/es/"
      ]
    },
    {
      "tag": "bienestar_universitario",
      "patterns": [
        "¿Qué servicios ofrece el bienestar universitario?",
        "¿Cómo puedo acceder a los servicios de salud en la universidad?"
      ],
      "responses": [
        "Bienestar Universitario ofrece una variedad de servicios, incluyendo salud, deportes y cultura. Más detalles en https://bienestaruniversitario.medellin.unal.edu.co/"
      ]
    },
    {
      "tag": "facultad_arquitectura",
      "patterns": [
        "¿Qué carreras ofrece la facultad de arquitectura?",
        "Quiero información sobre los programas de la facultad de arquitectura"
      ],
      "responses": [
        "La facultad de arquitectura ofrece programas en arquitectura y diseño. Puedes encontrar más información aquí: http://www.pregrado.unal.edu.co/programas-acred/"
      ]
    },
    {
      "tag": "registro_matricula",
      "patterns": [
        "¿Dónde puedo encontrar información para admitidos de pregrado?",
        "Necesito detalles sobre el proceso de matrícula para postgrado"
      ],
      "responses": [
        "Toda la información sobre registro y matrícula la puedes encontrar en nuestro sitio web: https://registroymatricula.medellin.unal.edu.co/"
      ]
    },
    {
      "tag": "despedida",
      "patterns": ["Adiós", "Hasta luego", "Gracias por la ayuda"],
      "responses": [
        "¡Adiós! Espero haberte sido de ayuda. ¡Vuelve pronto!",
        "Hasta luego, ¡espero que tengas un gran día!",
        "De nada, ¡estoy aquí para ayudarte cuando lo necesites!"
      ]
    }
  ]
}
